<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"f9337d26f65102bd3ff8357f337a68d8514582730ae28e1493ec44ce8e176bcc","plan_job_ref":"Job Environment Main - Plan #1817 at https://github.com/jarrod-lowe/wildsea/actions/runs/18123387597","plan_out_hash":"3e658b52e5d06379c0f05bafb29b21b1e950881806cfbaa9fbbd2ffc311adf50","plan_hash":"6a64e5aed33dd257ce5e495fd2a7a224516573796094f4b1550c1dbe225eb02c","plan_text_format":"diff-trunc","version":"2.2.2"} -->
Terraform plan in __terraform/environment/wildsea__
With backend config: `bucket=terraform-state-021891603679 key=primary/terraform.tfstate region=ap-southeast-2`<details open><summary>With variables</summary>

```hcl
domain_name          = "wildsea.lowe.kiwi"
environment          = "primary"
google_client_id     = (sensitive value)
google_client_secret = (sensitive value)
saml_metadata_url    = (sensitive value)
sns_alarm_topic_arn  = "arn:aws:sns:ap-southeast-2:453430506965:Pushover"
```
</details>
<details>
<summary>Plan: 17 to add, 5 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.wildsea.data.aws_iam_policy_document.asset_uploads_pipe will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "asset_uploads_pipe" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "sqs:DeleteMessage",
+               "sqs:GetQueueAttributes",
+               "sqs:ReceiveMessage",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
        }
+       statement {
+           actions   = [
+               "states:StartSyncExecution",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
        }
+       statement {
+           actions   = [
+               "events:PutEvents",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:events:ap-southeast-2:021891603679:event-bus/Wildsea-primary",
            ]
        }
    }

  # module.wildsea.data.aws_iam_policy_document.asset_uploads_queue will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "asset_uploads_queue" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "sqs:SendMessage",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "AllowS3ToSendMessages"

+           condition {
+               test     = "ArnEquals"
+               values   = [
+                   "arn:aws:s3:::wildsea-primary-assets",
                ]
+               variable = "aws:SourceArn"
            }
+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "021891603679",
                ]
+               variable = "aws:SourceAccount"
            }

+           principals {
+               identifiers = [
+                   "s3.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.wildsea.data.aws_iam_policy_document.deleter_bus will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "deleter_bus" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "appsync:GraphQL",
            ]
+           resources = [
+               "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/types/Mutation/fields/deletePlayer",
            ]
+           sid       = "InvokeGraphQL"
        }
    }

  # module.wildsea.data.aws_iam_policy_document.expire_asset_bus will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "expire_asset_bus" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "appsync:GraphQL",
            ]
+           resources = [
+               "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/types/Mutation/fields/_expireAsset",
            ]
+           sid       = "InvokeGraphQL"
        }
    }

  # module.wildsea.data.aws_iam_policy_document.finalise_asset_bus will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "finalise_asset_bus" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "appsync:GraphQL",
            ]
+           resources = [
+               "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/types/Mutation/fields/_finaliseAsset",
            ]
+           sid       = "InvokeGraphQL"
        }
    }

  # module.wildsea.aws_appsync_function.function["requestAssetUpload"] will be updated in-place
!~  resource "aws_appsync_function" "function" {
!~      code                      = <<-EOT
            // function/requestAssetUpload/requestAssetUpload.ts
            import { util } from "@aws-appsync/utils";
            
            // environment.json
            var environment_default = { name: "primary" };
            
            // lib/constants/entityTypes.ts
            var TypeAsset = "ASSET";
            
            // lib/constants/dbPrefixes.ts
            var DDBPrefixGame = "GAME";
            var DDBPrefixSection = "SECTION";
            var DDBPrefixAsset = "ASSET";
            
            // lib/constants/assetStatus.ts
            var ASSET_STATUS_PENDING = "PENDING";
            
            // lib/constants/assets.ts
          - var MAX_ASSET_SIZE_BYTES = 0;
          + var MAX_ASSET_SIZE_BYTES = 5 * 1024 * 1024;
            var ASSET_CLEANUP_TIMEOUT_SECONDS = 30;
            var ALLOWED_ASSET_MIME_TYPES = [
              "image/jpeg",
              "image/png",
              "image/gif",
              "image/webp"
            ];
            
            // function/requestAssetUpload/requestAssetUpload.ts
            function request(context) {
              if (!context.identity) util.unauthorized();
              const identity = context.identity;
              if (!identity?.sub) util.unauthorized();
              const input = context.arguments.input;
              const assetId = util.autoId();
              const timestamp = util.time.nowISO8601();
              const expireUploadAtSeconds = util.time.nowEpochSeconds() + ASSET_CLEANUP_TIMEOUT_SECONDS;
              const expireUploadAt = util.time.epochMilliSecondsToISO8601(
                expireUploadAtSeconds * 1e3
              );
              if (!ALLOWED_ASSET_MIME_TYPES.includes(input.mimeType)) {
                util.error(
                  "Invalid mime type. Only images are allowed.",
                  "InvalidMimeType"
                );
              }
              if (input.sizeBytes > MAX_ASSET_SIZE_BYTES) {
                util.error(
                  `File size too large. Maximum ${MAX_ASSET_SIZE_BYTES / (1024 * 1024)}MB allowed.`,
                  "FileTooLarge"
                );
              }
              const bucket = `wildsea-${environment_default.name}-assets`;
              const originalKey = `asset/game/${input.gameId}/section/${input.sectionId}/${assetId}/original`;
              const variantsPrefix = `asset/game/${input.gameId}/section/${input.sectionId}/${assetId}/variants/`;
              const assetData = {
                gameId: input.gameId,
                sectionId: input.sectionId,
                assetId,
                label: input.label || void 0,
                status: ASSET_STATUS_PENDING,
                bucket,
                originalKey,
                variantsPrefix,
                mimeType: input.mimeType,
                sizeBytes: input.sizeBytes,
                createdAt: timestamp,
                updatedAt: timestamp,
                expireUploadAt,
                type: TypeAsset
              };
              const assetItem = {
                operation: "PutItem",
                table: "Wildsea-" + environment_default.name,
                key: util.dynamodb.toMapValues({
                  PK: DDBPrefixGame + "#" + input.gameId,
                  SK: DDBPrefixAsset + "#" + assetId
                }),
                attributeValues: util.dynamodb.toMapValues(assetData)
              };
              const gameItem = {
                operation: "UpdateItem",
                table: "Wildsea-" + environment_default.name,
                key: util.dynamodb.toMapValues({
                  PK: DDBPrefixGame + "#" + input.gameId,
                  SK: DDBPrefixGame
                }),
                update: {
                  expression: "SET #updatedAt = :updatedAt, #remainingAssets = #remainingAssets - :one",
                  expressionNames: {
                    "#updatedAt": "updatedAt",
                    "#remainingAssets": "remainingAssets"
                  },
                  expressionValues: util.dynamodb.toMapValues({
                    ":updatedAt": timestamp,
                    ":one": 1
                  })
                },
                condition: {
                  expression: "#remainingAssets > :zero",
                  expressionNames: {
                    "#remainingAssets": "remainingAssets"
                  },
                  expressionValues: util.dynamodb.toMapValues({
                    ":zero": 0
                  }),
                  returnValuesOnConditionCheckFailure: false
                }
              };
              const sectionItem = {
                operation: "UpdateItem",
                table: "Wildsea-" + environment_default.name,
                key: util.dynamodb.toMapValues({
                  PK: DDBPrefixGame + "#" + input.gameId,
                  SK: DDBPrefixSection + "#" + input.sectionId
                }),
                update: {
                  expression: "SET #updatedAt = :updatedAt, #assets = list_append(if_not_exists(#assets, :emptyList), :assetList)",
                  expressionNames: {
                    "#updatedAt": "updatedAt",
                    "#assets": "assets"
                  },
                  expressionValues: util.dynamodb.toMapValues({
                    ":updatedAt": timestamp,
                    ":emptyList": [],
                    ":assetList": [assetId]
                  })
                },
                condition: {
                  expression: "#userId = :userId",
                  expressionNames: {
                    "#userId": "userId"
                  },
                  expressionValues: util.dynamodb.toMapValues({
                    ":userId": identity.sub
                  }),
                  returnValuesOnConditionCheckFailure: false
                }
              };
              context.stash.assetData = assetData;
              context.stash.input = input;
              return {
                operation: "TransactWriteItems",
                transactItems: [assetItem, gameItem, sectionItem]
              };
            }
            function response(context) {
              if (context.error) {
                util.error(context.error.message, context.error.type, context.result);
              }
              return {
                assetData: context.stash.assetData,
                input: context.stash.input
              };
            }
            export {
              request,
              response
            };
          - //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsicmVxdWVzdEFzc2V0VXBsb2FkLnRzIiwgIi4uLy4uL2Vudmlyb25tZW50Lmpzb24iLCAiLi4vLi4vbGliL2NvbnN0YW50cy9lbnRpdHlUeXBlcy50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzL2RiUHJlZml4ZXMudHMiLCAiLi4vLi4vbGliL2NvbnN0YW50cy9hc3NldFN0YXR1cy50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzL2Fzc2V0cy50cyJdLAogICJtYXBwaW5ncyI6ICI7QUFBQSxTQUFTLFlBQTZDOzs7QUNBdEQsNEJBQUMsTUFBTyxVQUFTOzs7QUNTVixJQUFNLFlBQVk7OztBQ1RsQixJQUFNLGdCQUFnQjtBQUN0QixJQUFNLG1CQUFtQjtBQVd6QixJQUFNLGlCQUFpQjs7O0FDWHZCLElBQU0sdUJBQXVCOzs7QUNFN0IsSUFBTSx1QkFBdUI7QUFHN0IsSUFBTSxnQ0FBZ0M7QUFRdEMsSUFBTSwyQkFBMkI7QUFBQSxFQUN0QztBQUFBLEVBQ0E7QUFBQSxFQUNBO0FBQUEsRUFDQTtBQUNGOzs7QUxETyxTQUFTLFFBQ2QsU0FDbUM7QUFDbkMsTUFBSSxDQUFDLFFBQVEsU0FBVSxNQUFLLGFBQWE7QUFDekMsUUFBTSxXQUFXLFFBQVE7QUFDekIsTUFBSSxDQUFDLFVBQVUsSUFBSyxNQUFLLGFBQWE7QUFFdEMsUUFBTSxRQUFRLFFBQVEsVUFBVTtBQUNoQyxRQUFNLFVBQVUsS0FBSyxPQUFPO0FBQzVCLFFBQU0sWUFBWSxLQUFLLEtBQUssV0FBVztBQUd2QyxRQUFNLHdCQUNKLEtBQUssS0FBSyxnQkFBZ0IsSUFBSTtBQUNoQyxRQUFNLGlCQUFpQixLQUFLLEtBQUs7QUFBQSxJQUMvQix3QkFBd0I7QUFBQSxFQUMxQjtBQUdBLE1BQUksQ0FBQyx5QkFBeUIsU0FBUyxNQUFNLFFBQVEsR0FBRztBQUN0RCxTQUFLO0FBQUEsTUFDSDtBQUFBLE1BQ0E7QUFBQSxJQUNGO0FBQUEsRUFDRjtBQUdBLE1BQUksTUFBTSxZQUFZLHNCQUFzQjtBQUMxQyxTQUFLO0FBQUEsTUFDSCxnQ0FBZ0Msd0JBQXdCLE9BQU8sS0FBSztBQUFBLE1BQ3BFO0FBQUEsSUFDRjtBQUFBLEVBQ0Y7QUFFQSxRQUFNLFNBQVMsV0FBVyxvQkFBWSxJQUFJO0FBQzFDLFFBQU0sY0FBYyxjQUFjLE1BQU0sTUFBTSxZQUFZLE1BQU0sU0FBUyxJQUFJLE9BQU87QUFDcEYsUUFBTSxpQkFBaUIsY0FBYyxNQUFNLE1BQU0sWUFBWSxNQUFNLFNBQVMsSUFBSSxPQUFPO0FBR3ZGLFFBQU0sWUFBdUI7QUFBQSxJQUMzQixRQUFRLE1BQU07QUFBQSxJQUNkLFdBQVcsTUFBTTtBQUFBLElBQ2pCO0FBQUEsSUFDQSxPQUFPLE1BQU0sU0FBUztBQUFBLElBQ3RCLFFBQVE7QUFBQSxJQUNSO0FBQUEsSUFDQTtBQUFBLElBQ0E7QUFBQSxJQUNBLFVBQVUsTUFBTTtBQUFBLElBQ2hCLFdBQVcsTUFBTTtBQUFBLElBQ2pCLFdBQVc7QUFBQSxJQUNYLFdBQVc7QUFBQSxJQUNYO0FBQUEsSUFDQSxNQUFNO0FBQUEsRUFDUjtBQUVBLFFBQU0sWUFBWTtBQUFBLElBQ2hCLFdBQVc7QUFBQSxJQUNYLE9BQU8sYUFBYSxvQkFBWTtBQUFBLElBQ2hDLEtBQUssS0FBSyxTQUFTLFlBQVk7QUFBQSxNQUM3QixJQUFJLGdCQUFnQixNQUFNLE1BQU07QUFBQSxNQUNoQyxJQUFJLGlCQUFpQixNQUFNO0FBQUEsSUFDN0IsQ0FBQztBQUFBLElBQ0QsaUJBQWlCLEtBQUssU0FBUyxZQUFZLFNBQVM7QUFBQSxFQUN0RDtBQUdBLFFBQU0sV0FBVztBQUFBLElBQ2YsV0FBVztBQUFBLElBQ1gsT0FBTyxhQUFhLG9CQUFZO0FBQUEsSUFDaEMsS0FBSyxLQUFLLFNBQVMsWUFBWTtBQUFBLE1BQzdCLElBQUksZ0JBQWdCLE1BQU0sTUFBTTtBQUFBLE1BQ2hDLElBQUk7QUFBQSxJQUNOLENBQUM7QUFBQSxJQUNELFFBQVE7QUFBQSxNQUNOLFlBQ0U7QUFBQSxNQUNGLGlCQUFpQjtBQUFBLFFBQ2YsY0FBYztBQUFBLFFBQ2Qsb0JBQW9CO0FBQUEsTUFDdEI7QUFBQSxNQUNBLGtCQUFrQixLQUFLLFNBQVMsWUFBWTtBQUFBLFFBQzFDLGNBQWM7QUFBQSxRQUNkLFFBQVE7QUFBQSxNQUNWLENBQUM7QUFBQSxJQUNIO0FBQUEsSUFDQSxXQUFXO0FBQUEsTUFDVCxZQUFZO0FBQUEsTUFDWixpQkFBaUI7QUFBQSxRQUNmLG9CQUFvQjtBQUFBLE1BQ3RCO0FBQUEsTUFDQSxrQkFBa0IsS0FBSyxTQUFTLFlBQVk7QUFBQSxRQUMxQyxTQUFTO0FBQUEsTUFDWCxDQUFDO0FBQUEsTUFDRCxxQ0FBcUM7QUFBQSxJQUN2QztBQUFBLEVBQ0Y7QUFHQSxRQUFNLGNBQWM7QUFBQSxJQUNsQixXQUFXO0FBQUEsSUFDWCxPQUFPLGFBQWEsb0JBQVk7QUFBQSxJQUNoQyxLQUFLLEtBQUssU0FBUyxZQUFZO0FBQUEsTUFDN0IsSUFBSSxnQkFBZ0IsTUFBTSxNQUFNO0FBQUEsTUFDaEMsSUFBSSxtQkFBbUIsTUFBTSxNQUFNO0FBQUEsSUFDckMsQ0FBQztBQUFBLElBQ0QsUUFBUTtBQUFBLE1BQ04sWUFDRTtBQUFBLE1BQ0YsaUJBQWlCO0FBQUEsUUFDZixjQUFjO0FBQUEsUUFDZCxXQUFXO0FBQUEsTUFDYjtBQUFBLE1BQ0Esa0JBQWtCLEtBQUssU0FBUyxZQUFZO0FBQUEsUUFDMUMsY0FBYztBQUFBLFFBQ2QsY0FBYyxDQUFDO0FBQUEsUUFDZixjQUFjLENBQUMsT0FBTztBQUFBLE1BQ3hCLENBQUM7QUFBQSxJQUNIO0FBQUEsSUFDQSxXQUFXO0FBQUEsTUFDVCxZQUFZO0FBQUEsTUFDWixpQkFBaUI7QUFBQSxRQUNmLFdBQVc7QUFBQSxNQUNiO0FBQUEsTUFDQSxrQkFBa0IsS0FBSyxTQUFTLFlBQVk7QUFBQSxRQUMxQyxXQUFXLFNBQVM7QUFBQSxNQUN0QixDQUFDO0FBQUEsTUFDRCxxQ0FBcUM7QUFBQSxJQUN2QztBQUFBLEVBQ0Y7QUFHQSxVQUFRLE1BQU0sWUFBWTtBQUMxQixVQUFRLE1BQU0sUUFBUTtBQUV0QixTQUFPO0FBQUEsSUFDTCxXQUFXO0FBQUEsSUFDWCxlQUFlLENBQUMsV0FBVyxVQUFVLFdBQVc7QUFBQSxFQUNsRDtBQUNGO0FBRU8sU0FBUyxTQUFTLFNBQTJCO0FBQ2xELE1BQUksUUFBUSxPQUFPO0FBQ2pCLFNBQUssTUFBTSxRQUFRLE1BQU0sU0FBUyxRQUFRLE1BQU0sTUFBTSxRQUFRLE1BQU07QUFBQSxFQUN0RTtBQUdBLFNBQU87QUFBQSxJQUNMLFdBQVcsUUFBUSxNQUFNO0FBQUEsSUFDekIsT0FBTyxRQUFRLE1BQU07QUFBQSxFQUN2QjtBQUNGOyIsCiAgIm5hbWVzIjogW10KfQo=
          + //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsicmVxdWVzdEFzc2V0VXBsb2FkLnRzIiwgIi4uLy4uL2Vudmlyb25tZW50Lmpzb24iLCAiLi4vLi4vbGliL2NvbnN0YW50cy9lbnRpdHlUeXBlcy50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzL2RiUHJlZml4ZXMudHMiLCAiLi4vLi4vbGliL2NvbnN0YW50cy9hc3NldFN0YXR1cy50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzL2Fzc2V0cy50cyJdLAogICJtYXBwaW5ncyI6ICI7QUFBQSxTQUFTLFlBQTZDOzs7QUNBdEQsNEJBQUMsTUFBTyxVQUFTOzs7QUNTVixJQUFNLFlBQVk7OztBQ1RsQixJQUFNLGdCQUFnQjtBQUN0QixJQUFNLG1CQUFtQjtBQVd6QixJQUFNLGlCQUFpQjs7O0FDWHZCLElBQU0sdUJBQXVCOzs7QUNFN0IsSUFBTSx1QkFBdUIsSUFBSSxPQUFPO0FBR3hDLElBQU0sZ0NBQWdDO0FBUXRDLElBQU0sMkJBQTJCO0FBQUEsRUFDdEM7QUFBQSxFQUNBO0FBQUEsRUFDQTtBQUFBLEVBQ0E7QUFDRjs7O0FMRE8sU0FBUyxRQUNkLFNBQ21DO0FBQ25DLE1BQUksQ0FBQyxRQUFRLFNBQVUsTUFBSyxhQUFhO0FBQ3pDLFFBQU0sV0FBVyxRQUFRO0FBQ3pCLE1BQUksQ0FBQyxVQUFVLElBQUssTUFBSyxhQUFhO0FBRXRDLFFBQU0sUUFBUSxRQUFRLFVBQVU7QUFDaEMsUUFBTSxVQUFVLEtBQUssT0FBTztBQUM1QixRQUFNLFlBQVksS0FBSyxLQUFLLFdBQVc7QUFHdkMsUUFBTSx3QkFDSixLQUFLLEtBQUssZ0JBQWdCLElBQUk7QUFDaEMsUUFBTSxpQkFBaUIsS0FBSyxLQUFLO0FBQUEsSUFDL0Isd0JBQXdCO0FBQUEsRUFDMUI7QUFHQSxNQUFJLENBQUMseUJBQXlCLFNBQVMsTUFBTSxRQUFRLEdBQUc7QUFDdEQsU0FBSztBQUFBLE1BQ0g7QUFBQSxNQUNBO0FBQUEsSUFDRjtBQUFBLEVBQ0Y7QUFHQSxNQUFJLE1BQU0sWUFBWSxzQkFBc0I7QUFDMUMsU0FBSztBQUFBLE1BQ0gsZ0NBQWdDLHdCQUF3QixPQUFPLEtBQUs7QUFBQSxNQUNwRTtBQUFBLElBQ0Y7QUFBQSxFQUNGO0FBRUEsUUFBTSxTQUFTLFdBQVcsb0JBQVksSUFBSTtBQUMxQyxRQUFNLGNBQWMsY0FBYyxNQUFNLE1BQU0sWUFBWSxNQUFNLFNBQVMsSUFBSSxPQUFPO0FBQ3BGLFFBQU0saUJBQWlCLGNBQWMsTUFBTSxNQUFNLFlBQVksTUFBTSxTQUFTLElBQUksT0FBTztBQUd2RixRQUFNLFlBQXVCO0FBQUEsSUFDM0IsUUFBUSxNQUFNO0FBQUEsSUFDZCxXQUFXLE1BQU07QUFBQSxJQUNqQjtBQUFBLElBQ0EsT0FBTyxNQUFNLFNBQVM7QUFBQSxJQUN0QixRQUFRO0FBQUEsSUFDUjtBQUFBLElBQ0E7QUFBQSxJQUNBO0FBQUEsSUFDQSxVQUFVLE1BQU07QUFBQSxJQUNoQixXQUFXLE1BQU07QUFBQSxJQUNqQixXQUFXO0FBQUEsSUFDWCxXQUFXO0FBQUEsSUFDWDtBQUFBLElBQ0EsTUFBTTtBQUFBLEVBQ1I7QUFFQSxRQUFNLFlBQVk7QUFBQSxJQUNoQixXQUFXO0FBQUEsSUFDWCxPQUFPLGFBQWEsb0JBQVk7QUFBQSxJQUNoQyxLQUFLLEtBQUssU0FBUyxZQUFZO0FBQUEsTUFDN0IsSUFBSSxnQkFBZ0IsTUFBTSxNQUFNO0FBQUEsTUFDaEMsSUFBSSxpQkFBaUIsTUFBTTtBQUFBLElBQzdCLENBQUM7QUFBQSxJQUNELGlCQUFpQixLQUFLLFNBQVMsWUFBWSxTQUFTO0FBQUEsRUFDdEQ7QUFHQSxRQUFNLFdBQVc7QUFBQSxJQUNmLFdBQVc7QUFBQSxJQUNYLE9BQU8sYUFBYSxvQkFBWTtBQUFBLElBQ2hDLEtBQUssS0FBSyxTQUFTLFlBQVk7QUFBQSxNQUM3QixJQUFJLGdCQUFnQixNQUFNLE1BQU07QUFBQSxNQUNoQyxJQUFJO0FBQUEsSUFDTixDQUFDO0FBQUEsSUFDRCxRQUFRO0FBQUEsTUFDTixZQUNFO0FBQUEsTUFDRixpQkFBaUI7QUFBQSxRQUNmLGNBQWM7QUFBQSxRQUNkLG9CQUFvQjtBQUFBLE1BQ3RCO0FBQUEsTUFDQSxrQkFBa0IsS0FBSyxTQUFTLFlBQVk7QUFBQSxRQUMxQyxjQUFjO0FBQUEsUUFDZCxRQUFRO0FBQUEsTUFDVixDQUFDO0FBQUEsSUFDSDtBQUFBLElBQ0EsV0FBVztBQUFBLE1BQ1QsWUFBWTtBQUFBLE1BQ1osaUJBQWlCO0FBQUEsUUFDZixvQkFBb0I7QUFBQSxNQUN0QjtBQUFBLE1BQ0Esa0JBQWtCLEtBQUssU0FBUyxZQUFZO0FBQUEsUUFDMUMsU0FBUztBQUFBLE1BQ1gsQ0FBQztBQUFBLE1BQ0QscUNBQXFDO0FBQUEsSUFDdkM7QUFBQSxFQUNGO0FBR0EsUUFBTSxjQUFjO0FBQUEsSUFDbEIsV0FBVztBQUFBLElBQ1gsT0FBTyxhQUFhLG9CQUFZO0FBQUEsSUFDaEMsS0FBSyxLQUFLLFNBQVMsWUFBWTtBQUFBLE1BQzdCLElBQUksZ0JBQWdCLE1BQU0sTUFBTTtBQUFBLE1BQ2hDLElBQUksbUJBQW1CLE1BQU0sTUFBTTtBQUFBLElBQ3JDLENBQUM7QUFBQSxJQUNELFFBQVE7QUFBQSxNQUNOLFlBQ0U7QUFBQSxNQUNGLGlCQUFpQjtBQUFBLFFBQ2YsY0FBYztBQUFBLFFBQ2QsV0FBVztBQUFBLE1BQ2I7QUFBQSxNQUNBLGtCQUFrQixLQUFLLFNBQVMsWUFBWTtBQUFBLFFBQzFDLGNBQWM7QUFBQSxRQUNkLGNBQWMsQ0FBQztBQUFBLFFBQ2YsY0FBYyxDQUFDLE9BQU87QUFBQSxNQUN4QixDQUFDO0FBQUEsSUFDSDtBQUFBLElBQ0EsV0FBVztBQUFBLE1BQ1QsWUFBWTtBQUFBLE1BQ1osaUJBQWlCO0FBQUEsUUFDZixXQUFXO0FBQUEsTUFDYjtBQUFBLE1BQ0Esa0JBQWtCLEtBQUssU0FBUyxZQUFZO0FBQUEsUUFDMUMsV0FBVyxTQUFTO0FBQUEsTUFDdEIsQ0FBQztBQUFBLE1BQ0QscUNBQXFDO0FBQUEsSUFDdkM7QUFBQSxFQUNGO0FBR0EsVUFBUSxNQUFNLFlBQVk7QUFDMUIsVUFBUSxNQUFNLFFBQVE7QUFFdEIsU0FBTztBQUFBLElBQ0wsV0FBVztBQUFBLElBQ1gsZUFBZSxDQUFDLFdBQVcsVUFBVSxXQUFXO0FBQUEsRUFDbEQ7QUFDRjtBQUVPLFNBQVMsU0FBUyxTQUEyQjtBQUNsRCxNQUFJLFFBQVEsT0FBTztBQUNqQixTQUFLLE1BQU0sUUFBUSxNQUFNLFNBQVMsUUFBUSxNQUFNLE1BQU0sUUFBUSxNQUFNO0FBQUEsRUFDdEU7QUFHQSxTQUFPO0FBQUEsSUFDTCxXQUFXLFFBQVEsTUFBTTtBQUFBLElBQ3pCLE9BQU8sUUFBUSxNQUFNO0FBQUEsRUFDdkI7QUFDRjsiLAogICJuYW1lcyI6IFtdCn0K
        EOT
        id                        = "tfiz6mnf2nhyzpzkwm554sir5q-mtrvona5g5g3bloziirrapvpw4"
        name                      = "requestAssetUpload"
#        (10 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.wildsea.aws_appsync_graphql_api.graphql will be updated in-place
!~  resource "aws_appsync_graphql_api" "graphql" {
        id                            = "tfiz6mnf2nhyzpzkwm554sir5q"
        name                          = "Wildsea-primary"
!~      schema                        = <<-EOT
            scalar AWSTime
            scalar AWSDateTime
            scalar AWSTimestamp
            scalar AWSEmail
            scalar AWSJSON
            scalar AWSURL
            scalar AWSPhone
            scalar AWSIPAddress
            
            directive @aws_subscribe(mutations: [String!]!) on FIELD_DEFINITION
            directive @aws_auth(cognito_groups: [String!]!) on FIELD_DEFINITION
            directive @aws_api_key on FIELD_DEFINITION | OBJECT
            directive @aws_iam on FIELD_DEFINITION | OBJECT
            directive @aws_oidc on FIELD_DEFINITION | OBJECT
            directive @aws_cognito_user_pools(
              cognito_groups: [String!]
            ) on FIELD_DEFINITION | OBJECT
            
            type Mutation {
                createGame(input: CreateGameInput!): GameSummary! @aws_cognito_user_pools(cognito_groups: ["CreateGame"])
                joinGame(input: JoinGameInput!): PlayerSheetSummary! @aws_cognito_user_pools
                updateGame(input: UpdateGameInput!): GameSummary! @aws_cognito_user_pools
                deleteGame(input: DeleteGameInput!): GameSummary! @aws_cognito_user_pools
                updateJoinCode(input: UpdateJoinCodeInput!): GameSummary! @aws_cognito_user_pools
                createSection(input: CreateSectionInput!): SheetSection! @aws_cognito_user_pools
                updateSection(input: UpdateSectionInput!): SheetSection! @aws_cognito_user_pools
                deleteSection(input: DeleteSectionInput!): SheetSection! @aws_cognito_user_pools
                updatePlayer(input: UpdatePlayerInput!): PlayerSheetSummary @aws_cognito_user_pools
                deletePlayer(input: DeletePlayerInput!): PlayerSheetSummary @aws_cognito_user_pools @aws_iam
                createNPC(input: CreateNPCInput!): PlayerSheetSummary! @aws_cognito_user_pools
                rollDice(input: RollDiceInput!): DiceRoll! @aws_cognito_user_pools
                updateUserSettings(input: UpdateUserSettingsInput!): UserSettings! @aws_cognito_user_pools
                setSystemNotification(input: SetSystemNotificationInput!): SystemNotification! @aws_iam
                requestAssetUpload(input: RequestAssetUploadInput!): AssetUploadTicket! @aws_cognito_user_pools
                _expireAsset(input: ExpireAssetInput!): Asset! @aws_iam
          +     _finaliseAsset(input: FinaliseAssetInput!): Asset! @aws_iam
          +     deleteAsset(input: DeleteAssetInput!): Asset! @aws_cognito_user_pools @aws_iam
            }
            
            type GamesWithQuota @aws_cognito_user_pools {
              games: [PlayerSheetSummary!]!
              remainingGames: Int!
              totalQuota: Int!
            }
            
            type Query {
                getGame(input: GetGameInput!): Game! @aws_cognito_user_pools
                getGames: GamesWithQuota! @aws_cognito_user_pools
                getGameTypes(input: GetGameTypesInput!): [GameTypeMetadata!]! @aws_cognito_user_pools
                getCharacterTemplates(input: GetCharacterTemplatesInput!): [CharacterTemplateMetadata!]! @aws_cognito_user_pools
                getCharacterTemplate(input: GetCharacterTemplateInput!): [TemplateSectionData!]! @aws_cognito_user_pools
                getGamePresets(input: GetGamePresetsInput!): [GamePresetItem!]! @aws_cognito_user_pools
                getUserSettings: UserSettings @aws_cognito_user_pools
                getSystemNotification: SystemNotification @aws_cognito_user_pools
            }
            
            type Subscription @aws_cognito_user_pools {
              updatedPlayer(gameId: ID!): PlayerSheetSummary @aws_subscribe(mutations: ["updatePlayer", "deletePlayer", "createNPC", "joinGame"])
              updatedSection(gameId: ID!): SheetSection @aws_subscribe(mutations: ["createSection", "updateSection", "deleteSection"])
              updatedGame(gameId: ID!): GameSummary @aws_subscribe(mutations: ["updateGame", "deleteGame", "updateJoinCode"])
              diceRolled(gameId: ID!): DiceRoll @aws_subscribe(mutations: ["rollDice"])
              updatedUserSettings: UserSettings @aws_subscribe(mutations: ["updateUserSettings"])
              systemNotificationUpdated: SystemNotification @aws_subscribe(mutations: ["setSystemNotification"])
          -   updatedAsset(gameId: ID!): Asset @aws_subscribe(mutations: ["_expireAsset"])
          +   updatedAsset(gameId: ID!): Asset @aws_subscribe(mutations: ["_expireAsset", "_finaliseAsset", "deleteAsset"])
            }
            
            input GetGameInput {
              gameId: ID!
              language: String!
            }
            
            input GetGameTypesInput {
              language: String!
            }
            
            input GetCharacterTemplatesInput {
              gameType: String!
              language: String!
            }
            
            input GetCharacterTemplateInput {
              templateName: String!
              gameType: String!
              language: String!
            }
            
            input GetGamePresetsInput {
              dataSetName: String!
              language: String!
            }
            
            input CreateGameInput {
                name: String!
                gameType: String!
                description: String
                language: String!
            }
            
            input JoinGameInput {
              joinCode: String!
              language: String!
            }
            
            input DeleteGameInput {
              gameId: ID!
            }
            
            input UpdateGameInput {
              gameId: ID!
              name: String!
              description: String
            }
            
            input UpdateJoinCodeInput {
              gameId: ID!
            }
            
            input DeletePlayerInput {
              gameId: ID!
              userId: ID!
            }
            
            input CreateSectionInput {
              userId: ID
              gameId: ID!
              sectionName: String!
              sectionType: String!
              content: AWSJSON
              position: Int!
            }
            
            input UpdateSectionInput {
              gameId: ID!
              sectionId: ID!
              sectionName: String
              content: AWSJSON
              position: Int
            }
            
            input DeleteSectionInput {
              gameId: ID!
              sectionId: ID!
            }
            
            type GameSummary @aws_cognito_user_pools {
              gameId: ID!
              gameName: String!
              gameType: String!
              gameDescription: String
              joinCode: String
              gmUserId: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              type: String!
              deleted: Boolean
              theme: String
              remainingCharacters: Int!
              remainingSections: Int!
              remainingAssets: Int!
            }
            
            type Game @aws_cognito_user_pools {
              gameId: ID!
              gameName: String!
              gameType: String!
              gameDescription: String
              playerSheets: [PlayerSheet!]!
              joinCode: String
              gmUserId: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              type: String!
              deleted: Boolean
              theme: String
              remainingCharacters: Int!
              remainingSections: Int!
              remainingAssets: Int!
            }
            
            input UpdatePlayerInput {
              gameId: ID!
              userId: ID!
              characterName: String!
            }
            
            input CreateNPCInput {
              gameId: ID!
              characterName: String!
            }
            
            type PlayerSheetSummary @aws_cognito_user_pools @aws_iam {
              userId: ID!
              gameId: ID!
              gameName: String!
              gameType: String!
              gameDescription: String
              characterName: String!
              type: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              deleted: Boolean
              remainingSections: Int!
            }
            
            type PlayerSheet @aws_cognito_user_pools {
              userId: ID!
              gameId: ID!
              characterName: String!
              sections: [SheetSection!]!
              type: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              gmUserId: ID!
              remainingSections: Int!
            }
            
            type SheetSection @aws_cognito_user_pools {
              userId: ID!
              gameId: ID!
              sectionId: ID!
              type: String!
              sectionName: String!
              sectionType: String!
              content: AWSJSON!
              position: Int!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              deleted: Boolean
              assets: [String!]
            }
            
            union Dice = SingleDie
            
            input DiceInput {
              type: String!
              size: Int!
              modifier: Int
            }
            
            input RollDiceInput {
              gameId: ID!
              dice: [DiceInput!]!
              action: String
              rollType: String!
              target: Int!
              onBehalfOf: ID
              messageType: String
            }
            
            type DiceRoll @aws_cognito_user_pools {
              gameId: ID!
              playerId: ID!
              playerName: String!
              dice: [Dice!]!
              rollType: String!
              target: Int!
              grade: String!
              action: String
              diceList: [Dice!]!
              value: Int!
              rolledAt: AWSDateTime!
              rolledBy: String!
              proxyRoll: Boolean!
              type: String!
              messageIndex: Int!
              messageType: String
            }
            
            type SingleDie @aws_cognito_user_pools {
              type: String!
              size: Int!
              value: Int!
            }
            
            type GameTypeMetadata @aws_cognito_user_pools {
              gameType: String!
              displayName: String!
              language: String!
            }
            
            type CharacterTemplateMetadata @aws_cognito_user_pools {
              templateName: String!
              displayName: String!
              gameType: String!
              language: String!
            }
            
            type TemplateSectionData @aws_cognito_user_pools {
              sectionName: String!
              sectionType: String!
              content: AWSJSON!
              position: Int!
            }
            
            type GamePresetItem @aws_cognito_user_pools {
              displayName: String!
              data: AWSJSON!
              language: String!
            }
            
            type UserSettings @aws_cognito_user_pools {
              userId: ID!
              settings: AWSJSON!
              type: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
            }
            
            input UpdateUserSettingsInput {
              settings: AWSJSON!
              language: String!
            }
            
            input SetSystemNotificationInput {
              message: String
              urgent: Boolean
            }
            
            type SystemNotification @aws_cognito_user_pools @aws_iam {
              message: String
              urgent: Boolean!
              type: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
            }
            
            type Asset @aws_cognito_user_pools @aws_iam {
              gameId: ID!
              sectionId: ID!
              assetId: ID!
              label: String
              status: AssetStatus!
              mimeType: String!
              sizeBytes: Int
              width: Int
              height: Int
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              type: String!
            }
            
            enum AssetStatus {
              PENDING
              READY
              EXPIRED
              CANCELED
            }
            
            type AssetUploadTicket @aws_cognito_user_pools {
              asset: Asset!
              uploadUrl: AWSURL!
              uploadFields: AWSJSON!
            }
            
            input RequestAssetUploadInput {
              gameId: ID!
              sectionId: ID!
              mimeType: String!
              sizeBytes: Int!
              label: String
            }
            
            input ExpireAssetInput {
              gameId: ID!
              assetId: ID!
            }
          + 
          + input FinaliseAssetInput {
          +   gameId: ID!
          +   assetId: ID!
          +   sectionId: ID!
          + }
          + 
          + input DeleteAssetInput {
          +   gameId: ID!
          +   sectionId: ID!
          +   assetId: ID!
          + }
        EOT
        tags                          = {
            "Name" = "Wildsea-primary"
        }
#        (12 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # module.wildsea.aws_appsync_resolver.resolver["_expireAsset"] will be updated in-place
!~  resource "aws_appsync_resolver" "resolver" {
!~      code              = <<-EOT
            // mutation/_expireAsset/_expireAsset.ts
            import { util } from "@aws-appsync/utils";
            
            // lib/constants/dbPrefixes.ts
            var DDBPrefixGame = "GAME";
            var DDBPrefixAsset = "ASSET";
            
            // lib/constants/assetStatus.ts
            var ASSET_STATUS_PENDING = "PENDING";
            var ASSET_STATUS_EXPIRED = "EXPIRED";
            
            // mutation/_expireAsset/_expireAsset.ts
            function request(context) {
              const input = context.arguments.input;
              const timestamp = util.time.nowISO8601();
              return {
                operation: "UpdateItem",
                key: util.dynamodb.toMapValues({
                  PK: DDBPrefixGame + "#" + input.gameId,
                  SK: DDBPrefixAsset + "#" + input.assetId
                }),
                update: {
                  expression: "SET #status = :expired, #updatedAt = :updatedAt",
                  expressionNames: {
                    "#status": "status",
                    "#updatedAt": "updatedAt"
                  },
                  expressionValues: util.dynamodb.toMapValues({
                    ":expired": ASSET_STATUS_EXPIRED,
                    ":updatedAt": timestamp
                  })
                },
                condition: {
                  expression: "#status = :pending",
                  expressionNames: {
                    "#status": "status"
                  },
                  expressionValues: util.dynamodb.toMapValues({
                    ":pending": ASSET_STATUS_PENDING
                  })
                }
              };
            }
            function response(context) {
              if (context.error) {
                util.error(context.error.message, context.error.type, context.result);
              }
              return context.result;
            }
            export {
              request,
              response
            };
          - //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiX2V4cGlyZUFzc2V0LnRzIiwgIi4uLy4uL2xpYi9jb25zdGFudHMvZGJQcmVmaXhlcy50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzL2Fzc2V0U3RhdHVzLnRzIl0sCiAgIm1hcHBpbmdzIjogIjtBQUFBLFNBQVMsWUFBcUI7OztBQ0F2QixJQUFNLGdCQUFnQjtBQVl0QixJQUFNLGlCQUFpQjs7O0FDWHZCLElBQU0sdUJBQXVCO0FBQzdCLElBQU0sdUJBQXVCOzs7QUZPN0IsU0FBUyxRQUNkLFNBQzJCO0FBQzNCLFFBQU0sUUFBUSxRQUFRLFVBQVU7QUFDaEMsUUFBTSxZQUFZLEtBQUssS0FBSyxXQUFXO0FBRXZDLFNBQU87QUFBQSxJQUNMLFdBQVc7QUFBQSxJQUNYLEtBQUssS0FBSyxTQUFTLFlBQVk7QUFBQSxNQUM3QixJQUFJLGdCQUFnQixNQUFNLE1BQU07QUFBQSxNQUNoQyxJQUFJLGlCQUFpQixNQUFNLE1BQU07QUFBQSxJQUNuQyxDQUFDO0FBQUEsSUFDRCxRQUFRO0FBQUEsTUFDTixZQUFZO0FBQUEsTUFDWixpQkFBaUI7QUFBQSxRQUNmLFdBQVc7QUFBQSxRQUNYLGNBQWM7QUFBQSxNQUNoQjtBQUFBLE1BQ0Esa0JBQWtCLEtBQUssU0FBUyxZQUFZO0FBQUEsUUFDMUMsWUFBWTtBQUFBLFFBQ1osY0FBYztBQUFBLE1BQ2hCLENBQUM7QUFBQSxJQUNIO0FBQUEsSUFDQSxXQUFXO0FBQUEsTUFDVCxZQUFZO0FBQUEsTUFDWixpQkFBaUI7QUFBQSxRQUNmLFdBQVc7QUFBQSxNQUNiO0FBQUEsTUFDQSxrQkFBa0IsS0FBSyxTQUFTLFlBQVk7QUFBQSxRQUMxQyxZQUFZO0FBQUEsTUFDZCxDQUFDO0FBQUEsSUFDSDtBQUFBLEVBQ0Y7QUFDRjtBQUVPLFNBQVMsU0FBUyxTQUEyQjtBQUNsRCxNQUFJLFFBQVEsT0FBTztBQUNqQixTQUFLLE1BQU0sUUFBUSxNQUFNLFNBQVMsUUFBUSxNQUFNLE1BQU0sUUFBUSxNQUFNO0FBQUEsRUFDdEU7QUFFQSxTQUFPLFFBQVE7QUFDakI7IiwKICAibmFtZXMiOiBbXQp9Cg==
          + //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiX2V4cGlyZUFzc2V0LnRzIiwgIi4uLy4uL2xpYi9jb25zdGFudHMvZGJQcmVmaXhlcy50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzL2Fzc2V0U3RhdHVzLnRzIl0sCiAgIm1hcHBpbmdzIjogIjtBQUFBLFNBQVMsWUFBcUI7OztBQ0F2QixJQUFNLGdCQUFnQjtBQVl0QixJQUFNLGlCQUFpQjs7O0FDWHZCLElBQU0sdUJBQXVCO0FBRTdCLElBQU0sdUJBQXVCOzs7QUZNN0IsU0FBUyxRQUNkLFNBQzJCO0FBQzNCLFFBQU0sUUFBUSxRQUFRLFVBQVU7QUFDaEMsUUFBTSxZQUFZLEtBQUssS0FBSyxXQUFXO0FBRXZDLFNBQU87QUFBQSxJQUNMLFdBQVc7QUFBQSxJQUNYLEtBQUssS0FBSyxTQUFTLFlBQVk7QUFBQSxNQUM3QixJQUFJLGdCQUFnQixNQUFNLE1BQU07QUFBQSxNQUNoQyxJQUFJLGlCQUFpQixNQUFNLE1BQU07QUFBQSxJQUNuQyxDQUFDO0FBQUEsSUFDRCxRQUFRO0FBQUEsTUFDTixZQUFZO0FBQUEsTUFDWixpQkFBaUI7QUFBQSxRQUNmLFdBQVc7QUFBQSxRQUNYLGNBQWM7QUFBQSxNQUNoQjtBQUFBLE1BQ0Esa0JBQWtCLEtBQUssU0FBUyxZQUFZO0FBQUEsUUFDMUMsWUFBWTtBQUFBLFFBQ1osY0FBYztBQUFBLE1BQ2hCLENBQUM7QUFBQSxJQUNIO0FBQUEsSUFDQSxXQUFXO0FBQUEsTUFDVCxZQUFZO0FBQUEsTUFDWixpQkFBaUI7QUFBQSxRQUNmLFdBQVc7QUFBQSxNQUNiO0FBQUEsTUFDQSxrQkFBa0IsS0FBSyxTQUFTLFlBQVk7QUFBQSxRQUMxQyxZQUFZO0FBQUEsTUFDZCxDQUFDO0FBQUEsSUFDSDtBQUFBLEVBQ0Y7QUFDRjtBQUVPLFNBQVMsU0FBUyxTQUEyQjtBQUNsRCxNQUFJLFFBQVEsT0FBTztBQUNqQixTQUFLLE1BQU0sUUFBUSxNQUFNLFNBQVMsUUFBUSxNQUFNLE1BQU0sUUFBUSxNQUFNO0FBQUEsRUFDdEU7QUFFQSxTQUFPLFFBQVE7QUFDakI7IiwKICAibmFtZXMiOiBbXQp9Cg==
        EOT
        id                = "tfiz6mnf2nhyzpzkwm554sir5q-Mutation-_expireAsset"
#        (10 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.wildsea.aws_appsync_resolver.resolver["_finaliseAsset"] will be created
+   resource "aws_appsync_resolver" "resolver" {
+       api_id      = "**************************"
+       arn         = (known after apply)
+       code        = <<-EOT
            // mutation/_finaliseAsset/_finaliseAsset.ts
            import { util } from "@aws-appsync/utils";
            
            // lib/constants/dbPrefixes.ts
            var DDBPrefixGame = "GAME";
            var DDBPrefixAsset = "ASSET";
            
            // lib/constants/assetStatus.ts
            var ASSET_STATUS_PENDING = "PENDING";
            var ASSET_STATUS_READY = "READY";
            
            // mutation/_finaliseAsset/_finaliseAsset.ts
            function request(context) {
              const input = context.arguments.input;
              const timestamp = util.time.nowISO8601();
              const { gameId, assetId } = input;
              return {
                operation: "UpdateItem",
                key: util.dynamodb.toMapValues({
                  PK: DDBPrefixGame + "#" + gameId,
                  SK: DDBPrefixAsset + "#" + assetId
                }),
                update: {
                  expression: "SET #status = :ready, #updatedAt = :updatedAt",
                  expressionNames: {
                    "#status": "status",
                    "#updatedAt": "updatedAt"
                  },
                  expressionValues: util.dynamodb.toMapValues({
                    ":ready": ASSET_STATUS_READY,
                    ":updatedAt": timestamp
                  })
                },
                condition: {
                  expression: "#status = :pending",
                  expressionNames: {
                    "#status": "status"
                  },
                  expressionValues: util.dynamodb.toMapValues({
                    ":pending": ASSET_STATUS_PENDING
                  })
                }
              };
            }
            function response(context) {
              if (context.error) {
                util.error(context.error.message, context.error.type, context.result);
              }
              return context.result;
            }
            export {
              request,
              response
            };
            //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiX2ZpbmFsaXNlQXNzZXQudHMiLCAiLi4vLi4vbGliL2NvbnN0YW50cy9kYlByZWZpeGVzLnRzIiwgIi4uLy4uL2xpYi9jb25zdGFudHMvYXNzZXRTdGF0dXMudHMiXSwKICAibWFwcGluZ3MiOiAiO0FBQUEsU0FBUyxZQUFxQjs7O0FDQXZCLElBQU0sZ0JBQWdCO0FBWXRCLElBQU0saUJBQWlCOzs7QUNYdkIsSUFBTSx1QkFBdUI7QUFDN0IsSUFBTSxxQkFBcUI7OztBRk8zQixTQUFTLFFBQ2QsU0FDMkI7QUFDM0IsUUFBTSxRQUFRLFFBQVEsVUFBVTtBQUNoQyxRQUFNLFlBQVksS0FBSyxLQUFLLFdBQVc7QUFFdkMsUUFBTSxFQUFFLFFBQVEsUUFBUSxJQUFJO0FBRTVCLFNBQU87QUFBQSxJQUNMLFdBQVc7QUFBQSxJQUNYLEtBQUssS0FBSyxTQUFTLFlBQVk7QUFBQSxNQUM3QixJQUFJLGdCQUFnQixNQUFNO0FBQUEsTUFDMUIsSUFBSSxpQkFBaUIsTUFBTTtBQUFBLElBQzdCLENBQUM7QUFBQSxJQUNELFFBQVE7QUFBQSxNQUNOLFlBQVk7QUFBQSxNQUNaLGlCQUFpQjtBQUFBLFFBQ2YsV0FBVztBQUFBLFFBQ1gsY0FBYztBQUFBLE1BQ2hCO0FBQUEsTUFDQSxrQkFBa0IsS0FBSyxTQUFTLFlBQVk7QUFBQSxRQUMxQyxVQUFVO0FBQUEsUUFDVixjQUFjO0FBQUEsTUFDaEIsQ0FBQztBQUFBLElBQ0g7QUFBQSxJQUNBLFdBQVc7QUFBQSxNQUNULFlBQVk7QUFBQSxNQUNaLGlCQUFpQjtBQUFBLFFBQ2YsV0FBVztBQUFBLE1BQ2I7QUFBQSxNQUNBLGtCQUFrQixLQUFLLFNBQVMsWUFBWTtBQUFBLFFBQzFDLFlBQVk7QUFBQSxNQUNkLENBQUM7QUFBQSxJQUNIO0FBQUEsRUFDRjtBQUNGO0FBRU8sU0FBUyxTQUFTLFNBQTJCO0FBQ2xELE1BQUksUUFBUSxPQUFPO0FBQ2pCLFNBQUssTUFBTSxRQUFRLE1BQU0sU0FBUyxRQUFRLE1BQU0sTUFBTSxRQUFRLE1BQU07QUFBQSxFQUN0RTtBQUVBLFNBQU8sUUFBUTtBQUNqQjsiLAogICJuYW1lcyI6IFtdCn0K
        EOT
+       data_source = "Wildsea_primary"
+       field       = "_finaliseAsset"
+       id          = (known after apply)
+       kind        = "UNIT"
+       region      = "ap-southeast-2"
+       type        = "Mutation"

+       runtime {
+           name            = "APPSYNC_JS"
+           runtime_version = "1.0.0"
        }
    }

  # module.wildsea.aws_appsync_resolver.resolver["deleteAsset"] will be created
+   resource "aws_appsync_resolver" "resolver" {
+       api_id      = "**************************"
+       arn         = (known after apply)
+       code        = <<-EOT
            // mutation/deleteAsset/deleteAsset.ts
            import { util } from "@aws-appsync/utils";
            function request(context) {
              const input = context.arguments.input;
              util.error(
                `deleteAsset not yet implemented for game ${input.gameId}`,
                "NotImplemented"
              );
            }
            function response(context) {
              return context.result;
            }
            export {
              request,
              response
            };
            //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiZGVsZXRlQXNzZXQudHMiXSwKICAibWFwcGluZ3MiOiAiO0FBQUEsU0FBUyxZQUFxQjtBQUd2QixTQUFTLFFBQVEsU0FBc0Q7QUFDNUUsUUFBTSxRQUFRLFFBQVEsVUFBVTtBQUNoQyxPQUFLO0FBQUEsSUFDSCw0Q0FBNEMsTUFBTSxNQUFNO0FBQUEsSUFDeEQ7QUFBQSxFQUNGO0FBQ0Y7QUFFTyxTQUFTLFNBQVMsU0FBMkI7QUFDbEQsU0FBTyxRQUFRO0FBQ2pCOyIsCiAgIm5hbWVzIjogW10KfQo=
        EOT
+       data_source = "Wildsea_primary"
+       field       = "deleteAsset"
+       id          = (known after apply)
+       kind        = "UNIT"
+       region      = "ap-southeast-2"
+       type        = "Mutation"

+       runtime {
+           name            = "APPSYNC_JS"
+           runtime_version = "1.0.0"
        }
    }

  # module.wildsea.aws_cloudwatch_event_rule.finalise_asset_rule will be created
+   resource "aws_cloudwatch_event_rule" "finalise_asset_rule" {
+       arn            = (known after apply)
+       description    = "Finalize assets when original file is uploaded"
+       event_bus_name = "Wildsea-primary"
+       event_pattern  = jsonencode(
            {
+               detail-type = [
+                   "ObjectCreated",
                ]
+               source      = [
+                   "asset.uploaded",
                ]
            }
        )
+       force_destroy  = false
+       id             = (known after apply)
+       name           = "Wildsea-primary-finalise-asset"
+       name_prefix    = (known after apply)
+       region         = "ap-southeast-2"
+       state          = "ENABLED"
+       tags_all       = {
+           "Application" = "Wildsea-primary"
        }
    }

  # module.wildsea.aws_cloudwatch_event_target.finalise_asset_target will be created
+   resource "aws_cloudwatch_event_target" "finalise_asset_target" {
+       arn            = "arn:aws:appsync:ap-southeast-2:021891603679:endpoints/graphql-api/2xdx2rdnwjbyznwjz4nc54dzbi"
+       event_bus_name = "Wildsea-primary"
+       force_destroy  = false
+       id             = (known after apply)
+       region         = "ap-southeast-2"
+       role_arn       = (known after apply)
+       rule           = "Wildsea-primary-finalise-asset"
+       target_id      = "**********************"

+       appsync_target {
+           graphql_operation = <<-EOT
                mutation FinaliseAssetBackground($input: FinaliseAssetInput!) {
                    _finaliseAsset(input: $input) {
                        assetId
                        createdAt
                        gameId
                        height
                        label
                        mimeType
                        sectionId
                        sizeBytes
                        status
                        type
                        updatedAt
                        width
                    }
                }
            EOT
        }

+       input_transformer {
+           input_paths    = {
+               "assetId"   = "$.detail.assetId"
+               "gameId"    = "$.detail.gameId"
+               "sectionId" = "$.detail.sectionId"
            }
+           input_template = jsonencode(
                {
+                   input = {
+                       assetId   = "<assetId>"
+                       gameId    = "<gameId>"
+                       sectionId = "<sectionId>"
                    }
                }
            )
        }
    }

  # module.wildsea.aws_cloudwatch_log_group.asset_path_parser will be created
+   resource "aws_cloudwatch_log_group" "asset_path_parser" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       log_group_class   = (known after apply)
+       name              = "/aws/vendedlogs/states/Wildsea-primary-asset-path-parser"
+       name_prefix       = (known after apply)
+       region            = "ap-southeast-2"
+       retention_in_days = 30
+       skip_destroy      = false
+       tags              = {
+           "Application" = "Wildsea-primary"
        }
+       tags_all          = {
+           "Application" = "Wildsea-primary"
        }
    }

  # module.wildsea.aws_iam_policy.deleter_bus will be updated in-place
!~  resource "aws_iam_policy" "deleter_bus" {
        id               = "arn:aws:iam::021891603679:policy/Wildsea-primary-deleter-bus"
        name             = "Wildsea-primary-deleter-bus"
!~      policy           = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = "appsync:GraphQL"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/types/Mutation/fields/deletePlayer"
-                       Sid      = "InvokeGraphQL"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
#        (7 unchanged attributes hidden)
    }

  # module.wildsea.aws_iam_policy.expire_asset_bus will be updated in-place
!~  resource "aws_iam_policy" "expire_asset_bus" {
        id               = "arn:aws:iam::021891603679:policy/Wildsea-primary-expire-asset-bus"
        name             = "Wildsea-primary-expire-asset-bus"
!~      policy           = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = "appsync:GraphQL"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/types/Mutation/fields/_expireAsset"
-                       Sid      = "InvokeGraphQL"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
#        (7 unchanged attributes hidden)
    }

  # module.wildsea.aws_iam_policy.finalise_asset_bus will be created
+   resource "aws_iam_policy" "finalise_asset_bus" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       id               = (known after apply)
+       name             = "Wildsea-primary-finalise-asset-bus"
+       name_prefix      = (known after apply)
+       path             = "/"
+       policy           = (known after apply)
+       policy_id        = (known after apply)
+       tags_all         = {
+           "Application" = "Wildsea-primary"
        }
    }

  # module.wildsea.aws_iam_role.asset_path_parser will be created
+   resource "aws_iam_role" "asset_path_parser" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
Plan is too large to fit in a PR comment. See the full plan in the workflow log.
```
</details>

:memo: Plan generated in [Environment Main - Plan #1817](https://github.com/jarrod-lowe/wildsea/actions/runs/18123387597)